app/controllers/articles_controller.rb

  def create
    # render plain: params[:article].inspect
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["text", "test"], ["created_at", "2015-07-04 17:02:44.433859"], ["updated_at", "2015-07-04 17:02:44.433859"]]